---
kind: other
id: Properties.T:Autodesk.Revit.DB.DetailCurveArrayIterator
source: html/58c8e919-80a9-cbf0-e80b-5c30f9b9bc20.htm
---
# DetailCurveArrayIterator Properties

Retrieves the item that is the current focus of the iterator.